<?php
return [
    'adminEmail' => 'admin@example.com',
    'supportEmail' => 'support@example.com',
    'user.passwordResetTokenExpire' => 3600,
    'CommentTeaching' => [
        ["id" => "1", "content" => "别具一格 匠心独运 (独到)"],
        ["id" => "2", "content" => "深入浅出 循循善诱 (方法)"],
        ["id" => "3", "content" => "身临其境 栩栩如生 (方法)"],
        ["id" => "4", "content" => "举一反三 融会贯通 (加量)"],
    ],
    'teacher_comment' => [
        'isFixStar' => false,
        'star' => 5
    ],
    'admin_rest' => [
        'key' => 'h{F#F5aG{vF\9v@w',
        'password' => '/vPh&b\RdTkkFj'
    ],
    'netease_im' => [
        'AppKey' => 'd1d4ecd02b9f573a240105f2b2f50a53',
        'AppSecret' => 'ac14f29a805d'
    ],
    'qiniu' => [
        'access_key' => 'W6AZJYVDZlBK-f7-v3FbUHOATU7lvGBO75cu-33D',
        'secret_key' => 'AkRuBEv0xVo1v87HXfTJjMLcx4_dF6zk5QRfBtdz',
    ],
    //七牛问答
    'hooray-ask' => [
        'bucket' => 'hooray-ask',
        'url' => 'http://hooray-ask.hihooray.net/',
    ],
    //七牛云空间
    'hooray-cloudspace' => [
        'bucket' => 'hooray-cloudspace',
        'url' => 'http://hooray-cloudspace.hihooray.net/',
    ],
    //七牛微课
    'hooray-weike' => [
        'bucket' => 'hooray-weike',
        'url' => 'http://hooray-weike.hihooray.net/',
    ],
    //七牛课堂
    'hooray-whiteboard' => [
        'bucket' => 'hooray-whiteboard',
        'url' => 'http://hooray-whiteboard.hihooray.net/',
    ],
    //七牛系统
    'hooray-system' => [
        'bucket' => 'hooray-system',
        'url' => 'http://hooray-system.hihooray.net/',
    ],
    //teacher upload
    'hooray-teacher-files' => [
        'bucket' => 'hooray-teacher-files',
        'url' => 'http://7xohrw.com2.z0.glb.qiniucdn.com/',
        'returnUrl' => '/teacherFiles/callback',
    ],
    //极光推送
    'jpush-pad' => [
        'appkey' => '908e8bd9d9ad4bc4d111e74d',
        'masterkey' => 'c8d4abdb0961cdba930fb7f8',
    ],
    'jpush-mobile' => [
        'appkey' => 'a4d908950168ab0b4f1a1788',
        'masterkey' => 'fb1b5b39ec7433280f60afac',
    ],
    //积分板块
    'credit_plate' => [
        'question' => '1', //问题
        'courses' => '2',  //课程
        'onlineCourses' => '3',//微课
        'file' => '4',     //资源管理器
        'comment' => '5',//评论
        'userbasic' => '6' //用户基本 登陆 签到等
    ],

    //控制最低价格
    'defaultCoins' => [
        'ask' => 4, //即时问
        'askSpecify' => 8, //指定老师
        'microCourse' => 2, //微课
        'reserve' => 2 //1V1辅导最低价格
    ],
    'task' => array(
        'serial_checkin_target' => 5,
        'serial_ask_target' => 3,
        'everyday_weike_target' => 3,
        'everyday_share_target' => 1,
    ),
    'directTeach' => [
        'scores' => [//一对一约课评分.可能需要用到负数,请保持字符索引
            '0' => '一般',
            '1' => '很好',
            '2' => '非常好',
        ]
    ],

    //超过最大接题次数
    'tchmaxjiedan' => 10,
    'mincoin' => 4,

    //重写常见错误码信息
    'r_400' => '请求错误，请稍后再试',
    'r_401' => '亲,请进行登录操作',
    'r_403' => '资源不可用',
    'r_404' => '找不到相关资源',
    'r_500' => '服务器返回错误',
    'r_501' => '服务器不支持该请求',
    'r_502' => '服务器错误',

    'u_200' => 'OK',
    'q_200' => 'OK',
    //服务器错误
    's_5001' => '数据传入错误',

    //及时问以6000开始
    'q_6001' => '老师没有开课认证',
    'q_6002' => '不能接自己提的问题',
    'q_6003' => '问题已经被接',
    'q_6004' => '今天您已经超出放弃',
    'q_6005' => '问题已经被删除',
    'q_6006' => '题目和解答者不符或者不存在',
    'q_6007' => '不能重复解答',
    'q_6008' => '非学生用户不能提问',
    'q_6009' => '哇哇豆不足，请去充值',
    'q_6010' => '问题提交失败',
    'q_6011' => '用户身份不正确',
    'q_6012' => '不能重复确认',
    'q_6013' => '确认失败',
    'q_6014' => '已经评价',
    'q_6015' => '评价失败',
    'q_6016' => '取消回答失败',
    'q_6017' => '更新订单错误,接题失败',
    'q_6018' => '回答问题失败',
    'q_6019' => '更新答案失败,回答失败',
    'q_6020' => '添加附件失败,回答失败',
    'q_6021' => '更新订单状态失败,确认失败',
    'q_6022' => '更新老师哇哇豆失败,确认失败',
    'q_6023' => '记录哇哇豆日志失败,确认失败',
    'q_6024' => '记录系统哇哇豆日志失败,确认失败',
    'q_6025' => '更新订单状态失败,回答失败',
    'q_6026' => '无法删除其他人提问的问题',
    'q_6027' => '学生删除问题失败',
    'q_6028' => '问题ID不能为空',
    'q_6029' => '无法删除其他人的答题',
    'q_6030' => '老师删除问题失败',
    'q_6031' => '登陆者身份未知,无法删除',
    'q_6032' => '此问题暂时无法删除',
    'q_6033' => '此问题学生已经删除',
    'q_6034' => '此问题老师已经删除',
    'q_6035' => '认证信息查询失败,请确认是否有接题资质',
    'q_6036' => '问题ID不能为空',
    'q_6037' => '此问题不存在',
    'q_6038' => '此问题订单不存在',
    'q_6039' => '不能解答认证资质之外的题目',
    'q_6040' => '阶段和科目不正确,请重新选择',
    'q_6041' => '请先回答已接的题目,然后再接新的题目',
    'q_6042' => '请求参数不正确',
    'q_6043' => '不能向老师提问认证资质之外的题目',
    'q_6044' => '老师接题已满，超出指定接题数量。',
    'q_6045' => '只有老师才能使用此接口',
    'q_6046' => '请求参数不完全',
    'q_6047' => '未知的type_id参数值',
    'q_6048' => '课程开始时间不能早于当前时间!',
    'q_6049' => '课程时间与已有课程时间冲突!',
    'q_6050' => '没有选择课程时间和价格!',

    'q_6451' => '充值数量不正确',

    'q_6601' => '充值卡已被使用',
    'q_6602' => '无效充值卡',
    'q_6603' => '充值卡兑换失败',
    'q_6604' => '此卡已被绑定专人使用',
    'q_6605' => '此卡已过有效期',
    'q_6606' => '此卡尚未激活',
    'q_6607' => '本次体验卡活动您已经参与过啦，后续活动请随时关注好哇学堂公众号哦！',
    'q_6608' => '亲！此项活动您已参加过，更多活动，敬请期待。',
    //用户中心以2000开始
    'u_2001' => '手机已被注册',
    'u_2002' => '手机号码输入错误',
    'u_2003' => '短信发送失败',
    'u_2004' => '短信验证码错误',
    'u_2005' => '用户名非法字符',
    'u_2006' => '用户已经存在',
    'u_2007' => '请输入3-17个字符',
    'u_2008' => '用户不存在',
    'u_2009' => '用户注册失败',
    'u_2010' => '绑定失败',
    'u_2011' => '用户名和手机号码不匹配',
    'u_2012' => '自己不能关注自己',
    'u_2013' => '关注失败',
    'u_2014' => '已关注',
    'u_2015' => '取消关注失败',
    'u_2016' => '用户退出失败',
    'u_2017' => '用户名或者密码错误',
    'u_2018' => '请使用快捷登陆方式',
    'u_2019' => '请使用用户名登陆',
    'u_2020' => '无法判断登陆者类型',
    'u_2021' => '被关注者不存在',
    'u_2022' => '未关注此人',
    'u_2023' => '更新关注人数失败',
    'u_2024' => '无法判断被关注着类型',
    'u_2025' => '更新被关注者粉丝数失败',
    'u_2026' => '被关注者不存在',
    'u_2027' => '保存QQ用户信息失败',
    'u_2028' => '保存用户信息失败',
    'u_2029' => '认证初始化失败',
    'u_2030' => '学生信息保存失败',
    'u_2031' => '学生日志初始化失败',
    'u_2032' => '学生统计初始化失败',
    'u_2033' => '更新QQ用户信息失败',
    'u_2034' => '更新微信用户信息失败',
    'u_2035' => '保存微信用户信息失败',
    'u_2036' => '不允许学生用户登录',
    'u_2037' => '不允许老师用户登录',
    'u_2038' => '此用户不能使用QQ快捷登陆',
    'u_2039' => '此用户不能使用微信快捷登陆',
    'u_2040' => '只有老师才有认证教学资格',
    'u_2041' => '老师未认证教学科目',
    'u_2042' => '提现哇哇豆不够.',
    'u_2043' => '你已经申请了提现,请待商家审批.',
    'u_2044' => '提现哇哇豆太少了.加油.',
    'u_2045' => '不允许学生用户使用',
    'u_2046' => '不允许老师用户使用',
    'u_2047' => '请输入搜索的关键字',
    'u_2048' => '只有老师可以更新此信息',

    'u_2101' => '用户名不正确',
    'u_2110' => '邮箱已被注册',
    'u_2993' => '更新失败',
    'u_2999' => '亲,目前由于授权原因,暂时无法提供第三方登录',

    's_7001' => '亲,请进行登录操作',
    's_7008' => '修改密码失败',
    's_7009' => '头像更改失败',
    's_7011' => '手机更改失败',
    's_7012' => '学校更改失败',
    's_7015' => '邮箱不正确',
    's_7016' => '绑定邮箱失败',
    's_7017' => '密码长度太短,请输入至少6位',

    's_7101' => '收藏数据不存在',
    's_7777' => '重复收藏',

    'm_8001' => '短信发送失败',
    'm_8002' => '短信发送失败或没有发送，请尝试点击发送验证码',
    'm_8003' => '短信验证码错误',
    'm_8004' => '邮件验证码错误',
    'm_8005' => '邮件发送失败',

    //微课集
    'mc_9001' => '微课ID不能为空',
    'mc_9002' => '免费微课不需要购买',
    'mc_9003' => '订单创建失败',
    'mc_9004' => '不能购买自己的微课',
    'mc_9005' => '已经购买，且在有效期内',
    'mc_9006' => '订单ID不能为空',
    'mc_9007' => '订单不存在',
    'mc_9008' => '订单信息有误，无法支付',
    'mc_9009' => '不是微课订单',
    'mc_9010' => '哇哇豆不足，请充值',
    'mc_9011' => '更新学生哇豆失败',
    'mc_9012' => '更新订单状态失败',
    'mc_9013' => '更新学生哇哇豆日志失败',
    'mc_9014' => '更新老师哇哇豆失败',
    'mc_9015' => '更新老师哇哇豆日志失败',
    'mc_9016' => '购买失败',
    'mc_9017' => '取消订单失败',
    'mc_9018' => '订单无法支付',
    'mc_9019' => '订单无法取消',
    'mc_9020' => '用户ID为空，支付失败',
    'mc_9021' => '老师账号无法购买微课',
    'mc_9022' => '更新浏览次数失败',
    'mc_9023' => '更新微课购买量失败',
    'mc_9024' => '微课老师不存在，无法购买',
    'mc_9025' => '保存微课信息失败',
    'mc_9026' => '微课信息不全,无法保存',
    'mc_9027' => '年级科目信息有误,无法保存微课',
    'mc_9028' => '只有老师可以上传微课',
    'mc_9029' => '未找到属于您的这个微课',
    'mc_9030' => '无法确定操作内容',
    'mc_9031' => '微课已经是公开状态',
    'mc_9032' => '微课已经是未公开状态',
    'mc_9033' => '更改微课状态失败',
    'mc_9034' => '微课不存在或者已下线',
    'mc_9035' => '至少修改一项内容',
    'mc_9036' => '年纪,科目信息不全,无法更新',
    'mc_9037' => '只有老师可以更新微课信息',
    'mc_9038' => '微课不存在',
    'mc_9039' => '微课已被删除',
    'mc_9040' => '此微课不属于您,无法修改',
    'mc_9041' => '约课失败,可能是人数已满,或已过期',
    'mc_9042' => '取消失败,距离开课时间不足6个小时',

    //版本检测
    'v_10001' => 'pc版本获取失败',
    'v_10002' => '无法判断设备标识',
    'v_10003' => 'android版本获取失败',

    'subjects' => [
        '数学',
        '物理',
        '化学',
        '科学',
        '英语',
        '语文',
        '历史',
        '思品',
        '政治',
        '生物',
        '地理',
        '社会',
        '其他',
    ],

    'systemFee' => 0.3, //平台交易佣金（按比例收取）
    'systemUserId' => "system_coin_user", //平台提成 收哇哇豆用户id
    'systemEduCoinRate' => [ //系统按 老师等级 对应的提成比例 抽取佣金
        0 => 0.5,
        1 => 0.5,
        2 => 0.45,
        3 => 0.4,
        4 => 0.35,
        5 => 0.3,
        6 => 0.25,
        7 => 0.2,
        8 => 0.15,
        9 => 0.1,
        10 => 0.05
    ],
    // 老师每个等级对应的积分值
    'teacherLevelCredits' => [
        1 => 0,
        2 => 2650,
        3 => 5300,
        4 => 10600,
        5 => 15900,
        6 => 31800,
        7 => 47700,
        8 => 95400,
        9 => 143100,
        10 => 286200,
    ],
    // 及时问评价基础积分
    'teacherLevelMicroCardinality' => 30,
    // 及时问评价基础积分
    'teacherLevelCardinality' => 10,
    // 及时问评价对应积分系数
    'teacherLevelCoefficient' => [
        1 => 0.5,
        2 => 0.7,
        3 => 0.8,
        4 => 0.9,
        5 => 1,
    ],
    'tasks' => [
        0 => [
            'label' => '新手任务',
            'lists' => [
                0 => [
                    'label' => '注册登录',
                    'icon' => 'task-NdII0juMlOsY.png',
                    'desc' => '注册成功登录，即可轻松拿走奖励哦!',
                    'value' => 20,
                    'completed' => '未完成'
                ],
                1 => [
                    'label' => '完善资料',
                    'icon' => 'task-vf0gYb6f1ILu.png',
                    'desc' => '登录APP，并将自己的个人资料信息补充完整，即可完成任务',
                    'value' => 20,
                    'completed' => '未完成'
                ]
            ]
        ],
        1 => [
            'label' => '每日任务',
            'lists' => [
                0 => [
                    'label' => '签到打卡',
                    'icon' => 'task-NdII0juMlOsY.png',
                    'desc' => "1>登录APP,并点击[我要签到],即可拿到奖励哦!\n2>每天只能签到一次,连续签到有额外奖励哦!",
                    'value' => 1,
                    'completed' => '未完成'
                ],
                1 => [
                    'label' => '提问',
                    'icon' => 'task-JPbXsvYFoGNb.png',
                    'desc' => '发布问题，即可拿到奖励哦!',
                    'value' => 1,
                    'completed' => '未完成'
                ],
                2 => [
                    'label' => '评价',
                    'icon' => 'task-NdII0juMlOsY.png',
                    'desc' => '评价回答，即可拿到奖励哦!',
                    'value' => 1,
                    'completed' => '未完成'
                ],
                3 => [
                    'label' => '分享问题',
                    'icon' => 'task-c4VbuNYhjd2H.png',
                    'desc' => '分享问题，即可拿到奖励哦!',
                    'value' => 2,
                    'completed' => '未完成'
                ],
                4 => [
                    'label' => '购买微课',
                    'icon' => 'task-Z2ayZkLYc0DW.png',
                    'desc' => '购买微课，即可拿到奖励哦!',
                    'value' => 2,
                    'completed' => '未完成'
                ],
                5 => [
                    'label' => '评价微课',
                    'icon' => 'task-vf0gYb6f1ILu.png',
                    'desc' => '评价微课，即可拿到奖励哦!',
                    'value' => 2,
                    'completed' => '未完成'
                ],
                6 => [
                    'label' => '连续7天签到',
                    'icon' => 'task-RA9aO7I23jH2.png',
                    'desc' => "1>连续7天登录APP,并点击[我要签到],即可拿到奖励哦!\n2>中间如有间断，则重新计算天数",
                    'value' => 5,
                    'target' => 7,
                    'completed' => '0/7'
                ]
            ]
        ]
    ]
];
